Revit 2027 API
FabricationConfiguration.GetFabricationConfigurationInfo Method
 Gets the information about the fabrication configuration of the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationConfigurationInfo GetFabricationConfigurationInfo()
Public Function GetFabricationConfigurationInfo As FabricationConfigurationInfo
public:
FabricationConfigurationInfo^ GetFabricationConfigurationInfo()
member GetFabricationConfigurationInfo : unit -> FabricationConfigurationInfo
Return Value
FabricationConfigurationInfo
 The information about the fabrication configuration of the project.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace